
 const BOT_TOKEN = "8352464098:AAGZEbTUAiHRIQuuf3twqjIFes6SFIJ18GQ";

 const chatIds = [
   399163123, 1595555709,   67693990, 6305042492,   90855656,
   102195535, 1070441780, 5200733161, 2011037200, 1029034235,
   437524380,  371466546,  196623178,  113946613,  653699591,
   366885409,  576912042,  852819516, 1968143611,  123259006,
    28465150,  602110796,  123502502,  303563110, 1910507117,
  1061012690,  570441868,   92131508, 6604717089,  134604686,
    89065279,  635764292,   82558351,  428532183,  416103476,
  5265250215, 1065788634, 6685786483,  902638397, 1030058361,
   561227454,  219476348, 1788105817,  283476318, 5538443962,
   567887475,  125047322, 5689037124,  103210145, 7260393378,
   111217905,  811824096,  182935556,  510856679, 6347279822,
    36115647,  228006897, 5644495417, 7519068492,   97087109,
   182923347,  811960464,  271591159,  936819794, 1312711423,
  7609257674, 7384847936, 5244369933,  107683779, 6186733766,
   229977104, 1542633846, 1855983671, 5594989963, 5348636310,
   108848828, 1994864208, 7163280462,  422679320,  171794796,
  6859230616, 5743446639,  129119302, 6311871968,   92297109,
    79113490, 1262278149,  859870303, 7814228191
]

 const message = `🔷 سرور آمریکا اضافه شد 🔷

دکمه استارت رو بزنید و از قسمت خرید سرویس جدید میتونید اونو دریافت کنید
پشتیانی: @hero_support1

👇 برای شروع ربات، روی دکمه زیر بزنید:

/start`;

 async function sendMessages() {
   for (const chatId of chatIds) {
     try {
       const response = await fetch(
         `https:api.telegram.org/bot${BOT_TOKEN}/sendMessage`,
         {
           method: "POST",
           headers: {
             "Content-Type": "application/json",
           },
           body: JSON.stringify({
             chat_id: chatId,
             text: message,
           }),
         }
       );

       const data = await response.json();

       if (data.ok) {
         console.log(`✓ Sent to ${chatId}`);
       } else {
         console.log(`✗ Failed for ${chatId}`, data);
       }
     } catch (err) {
       console.error(`✗ Error for ${chatId}`, err);
     }
   }
 }

 sendMessages();